# My first bot

# Вітання і знайомство з ботом
hi_user = input(("Вітаємо вас. Привітайтеся з ботом: "))
hi_user = hi_user.lower()
name_user = input("Як вас звати?: ")
hi_user_list = hi_user.split()

# Проходим по всіх наведених відповідей користувача
for word in hi_user_list:
    if word in ["привет", "хай", "хелоу", "привіт", "доброго"]:
        print("Привіт", f"{name_user.capitalize()}.")

# Цикл while, вибір теми бота
tema_vopros = "так"
while tema_vopros == "так":
    tema_dialoge = input("Я можу порекомендувати вам (фільм/серіал), або навіть компютерну (гру), обирайте\
 (просто напишіть мені назву категорії): ")

    # За допомогою if-elif-else вибираємо тему рекомендації
    if tema_dialoge.lower() == "фільм":
        print("Я рекомендую тобі до вечірнього перегляду комедію 'Американський пиріг'.")
    elif tema_dialoge.lower() == "серіал":
        print("З серіалів можу порекомендувати 'Блудливая Калифорния'.")
    else:
        print("'Cyberpunk 2077', суперова гра 2020 року випуску.")
    tema_vopros = input("Чи бажаєш обрати іншу тему? (так/ні): ")

# Друга тема бота
vopros_python = input("Добре. Тоді маю до вас питання. Чи вивчаєте ви мову Python? (так/ні): ")

# Відповіть бота
if vopros_python.lower() == "так":
    vopros_python_2 = input("Круто, я за вас радий, як успіхи в навчанні? ")
    vopros_python_2 = vopros_python_2.lower()
    vopros_python_2_list = vopros_python_2.split()

    # Проходим по всіх наведенів прикладів відповіді користувача
    for word_1 in vopros_python_2_list:
        if word_1 in ["нормально", "важко", "норм", "добре", "чудово", "good"]:
            print("Ви молодець, навчайся далі, навіть якщо важко. Все прийде з часом. Головне не здавайся.")
elif vopros_python.lower() == "ні":
    print("Шкода. Рекомендував би вам звернути увагу на програмування, а саме на мову 'Python'.\
 Спробуйте, можливо це ваше.")

# Рандомне запитання від користувача
my_qweshin = input("Запитайте в мене щось, я спробую вам допомогти: ")
my_qweshin = my_qweshin.lower()
my_qweshin_list = my_qweshin.split()

# Відповіть бота
for word_2 in my_qweshin_list:
    if word_2 != []:
        print("Вибачте, я зараз тільки тестова версія, ще не повністю можу зрозуміти що ви маєте на увазі.")
print("Якщо маєте бажання ще зі мною поспілкуватися, можемо почати все з початку.)\
 Якщо ні, то на разі попрощаємось.")

# Функція прощання з ботом
poka = input("Можете попрощатися з ботом: ")
poka = poka.lower()
poka_list = poka.split()

# Проходимо по всіх можливих наведених відповідей користувача
for word_3 in poka_list:
    if word_3 in ["пока", "бай", "до", "бувай", "гудбай", "надобраніч"]:
        print("Бувай. До нових зустрічей.")